// This is just an example,
// so you can safely delete all default props below

export default {
  layout: {
    dashboard: 'Головна',
    modules: 'DDOS модулі',
    settings: 'Налаштування',
    top: 'Рейтинги',
    developers: 'Розробники',
  },
  modules: {
    active: {
      selected: "Виьбраний модуль для запуску",
      enabled: {
        title: "Модуль включений",
        caption: "Включити або відключити виконання модуля"
      },
      executionLog: "Журнал виконання",
      stdout: "Стандартний вивід (stdout)",
      stderr: "Стандартний вивід помилок (stderr)",
    }
  },
  top: {
    achivements: {
      peopleAreLikeShips: {
        title: "Люди як кораблі",
        subtitle: "якщо російські, то йдуть *****",

        body: "Схоже ти тільки що спробував(ла) вибрати російську мову. Ти потребуєш щоб ми тебе спаслі. Не переживай ми тебе скоро денацифікуємо і асвабадім.",
        explanationHint: "Я не розумію. Роздупліть для мене цей мем.",
        explanation: 'Це була перевірка! Ця опція відкрита для людей з інших країн і мов. Дивно що ти сюди завітав. Направляємо по тебе бандеромобіль',
      
        goodButton: "Я дурненький. Будь ласка, асвабадіть мене.",
        badButton: "Я не люблю Україну",
      },
    }
  },
  bootstrap: {
    title: "Схоже це твій перший запуск. Давай допоможемо тобі",

    header: {
      language: "Вибери мову",
      data: "Дані",
      itarmy: "ITArmy ID",
      module: "Модулі"
    },

    language: {
      continueButton: "Продовжити"
    },

    data: {
      body: "Додаток автоматично завантажить необхідні модулі і збереже їх на твоєму ПК. Модулі та всі дані будуть збережені в папці",
      windows: "Перед тим як продовжити, переконайся що ти додав папку з даними в віндовс дефендер та антивірусні винятки. В іншому випадку всі завантажені дані будуть видалені.",
      openDataFolderButton: "Відкрити папку з даними",
      changeDataFolderButton: "Змінити папку з даними",
      continueButton: "Продовжити",
      backButton: "Назад"
    },

    itarmy: {
      body: "Якщо у тебе є ITArmy ID, введи його нижче. Якщо немає, натисни кнопку продовжити",
      uuidInputTitle: "ITArmy ID",
      continueButton: "Продовжити",
      backButton: "Назад"
    },

    module: {
      body: "Вибери пресет. Всі дані можна потім змінити",
      installation: {
        title: "Встановлення модулів",
      },
      preset: {
        government: {
          title: "Державна установа / старий ПК",
          description: "Цей пресет використовує якомога менше ресурсів. Це може призвести до відключення деяких функцій модулів.",
        },
        laptop: {
          title: "Ноутбук",
          description: "Цей пресет спробує використати якомога менше ресурсів, але не відключатиме функції.",
        },
        normal: {
          title: "Нормальний",
          description: "Нормальний комп'ютер вдома. Цей пресет використовує конфігурацію, що постачається розробниками модулів за замовчуванням.",
        },
        max: {
          title: "Максимальний",
          description: "Максимальна потужність. Цей пресет використовує максимальні ресурси твого комп'ютера. Це може призвести до лагів в інших програмах.",
        },
        expert: {
          title: "Експерт",
          description: "Цей пресет не виконує жодних дій. Всі налаштування треба проводити вручну.",
        }
      }
    },

    doneDialog: {
      title: "Налаштування завершено",
      body: "Тепер ви можете почати використовувати аплікацію. Але нам потрібно ще трішки часу щоб все підготувати (1-3 хвилини). Протягом цього часу може не бути оновлень в головному дашборді. Це нормально для першого запуску :) За кілька хвилин на головному дашборді повляться графікі і актуальна інформація.",
      finishButton: "Клас!. Почнемо!",
    }
  }
}
